Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/money_and_tax/tax/capital_taxes/capital_acquisitions_tax.html.txt.tmx
Source language: en
Languages: ga

source: • Making a return and paying Capital Acquisitions Tax
ga: • Ag tabhairt faisnéis cánach agus ag íoc Cáin Fháltais Caipitiúil

source: If you receive a gift, you may have to pay gift tax on it
ga: Má fhaigheann tú bronntanas, b'fhéidir go mbeidh Cáin Bhronntanais le n-íoc agat air

source: If you receive an inheritance following a death, it may be liable to inheritance tax
ga: Má fhaigheann tú oidhreacht tar éis báis, b'fhéidir go mbeidh Cáin Oidhreachta le gearradh air

source: Both these taxes are types of Capital Acquisitions Tax
ga: Is cineálacha Cánach Fháltais Caipitiúil (CFC) iad an dá cháin seo

source: The benefit (the gift or inheritance) is taxed if its value is over a certain limit or threshold
ga: Gearrtar cáin ar an sochar (an bronntanas nó an oidhreacht) má tá luach thar teorainn nó tairseach áirithe aige

source: Different tax-free thresholds apply depending on the relationship between the disponer (the person giving the benefit) and the beneficiary (the person receiving the benefit)
ga: Bíonn tairseacha saor ó cháin difriúla i gceist ag brath ar an ngaol idir an teisteoir (an duine a thugann an sochar) agus an tairbhí (an duine a fhaigheann an sochar)

source: There are also a number of exemptions and reliefs that depend on the type of the gift or inheritance
ga: Tá roinnt díolúintí agus faoisimh éagsúla ann ag brath ar an gcineál bronntanais nó oidhreachta atá i gceist

source: If you receive a gift or inheritance from your spouse or civil partner, you are exempt from Capital Acquisitions Tax
ga: Tá tú díolmhaithe ó Cháin Fháltais Caipitiúil má fhaigheann tú bronntanas nó oidhreacht ó do chéile/páirtnéir sibhialta

source: The tax applies to all property that is located in Ireland
ga: Baineann an cháin le gach maoin atá lonnaithe in Éirinn

source: It also applies where the property is not located in Ireland but either the person giving the benefit or the person receiving it are resident or ordinarily resident in Ireland for tax purposes
ga: Baineann sí freisin le maoin nach bhfuil lonnaithe in Éirinn nuair atá ceachtar den duine a thugann an sochar nó an duine atá á fháil ina chónaí nó ina ghnáthchónaí in Éirinn chun críocha cánach

source: Gifts and inheritances can be received tax-free up to a certain amount
ga: Is féidir bronntanais agus oidhreachtaí a fháil saor ó cháin suas go dtí méid áirithe

source: The tax-free amount, or threshold, varies depending on your relationship to the person giving the benefit
ga: Athraíonn an méid saor ó cháin, nó an tairseach, seo ag brath ar an ngaol atá agat leis an duine a thugann an sochar

source: There are three different categories or groups
ga: Tá trí chatagóirí nó grúpaí difriúla

source: Each has a threshold that applies to the total benefits you have received in that category since 5 December 1991
ga: Tá tairseach ag gach ceann a bhaineann leis na sochair iomlána a fuair tú sa chatagóir sin ón 5 Nollaig 1991 i leith

source: Group A applies where the beneficiary, the person receiving the benefit, is a child of the person giving it
ga: Bíonn Grúpa A i gceist nuair atá an tairbhí, an duine a fhaigheann an sochar, mar pháiste ag an té atá á thabhairt

source: This includes a stepchild or an adopted child
ga: Bíonn leasleanbh nó páiste uchtaithe san áireamh anseo freisin

source: It can also include a foster child if the foster child resided with and was under the care of the disponer and they provided the care, at their expense, for a period or periods totalling at least 5 years before the foster child reached the age of 18
ga: Is féidir páiste altrama a bheith cuimsithe anseo má chónaigh an páiste altrama leis an diúscróir agus faoina chúram, agus gur chuir sé/sí an cúram ar fáil, ar a c(h)ostas féin, ar feadh tréimhse nó tréimhsí ar a laghad 5 bliana ar an iomlán sular shroich an páiste altrama 18 mbliana d’aois

source: This minimum period does not apply in the case of an inheritance taken on the date of death of the disponer
ga: Ní bhaineann an íostréimhse seo i gcás oidhreachta a thógtar ar dháta báis an diúscróra

source: In this case the Group A threshold will apply provided that the foster child had been placed in the care of the disponer prior to that date
ga: Sa chás seo is é tairseach Grúpa A a bheidh i gceist chomh fada is go raibh an páiste altrama curtha faoi chúram an diúscróra roimh an dáta sin

source: Group A also applies to parents who take an inheritance from their child but only where the parent takes full and complete ownership of the inheritance
ga: Baineann Grúpa A le tuismitheoirí a fhaigheann oidhreacht óna gclann, sa chás go nglacann an tuismitheoir úinéireacht iomlán an oidhreachta amháin

source: If a parent receives an inheritance where he or she does not have full and complete ownership of the benefit, or if a parent receives a gift, then Group B applies
ga: Má fhaigheann tuismitheoir oidhreacht agus gan úinéireacht iomlán a bheith acu ar an sochar, nó má fhaigheann tuismitheoir bronntanas, bíonn Grúpa B i gceist

source: If a parent inherits from their child, and have full and complete ownership of the inheritance it is exempt from tax if, in the previous five years, the child took an inheritance or gift from either parent and it was not exempt from Capital Acquisitions Tax
ga: Má fhaigheann tuismitheoir oidhreacht óna bpáiste, le húinéireacht iomlán na hoidhreachta acu, bíonn sí díolmhaithe ó cháin más rud é go bhfuair an páiste oidhreacht nó bronntanas ó cheachtar den dá thuismitheoir nach raibh díolmhaithe ó Cháin Fháltais Caipitiúil sna cúig bliana roimhe sin

source: In this case, no tax needs to be paid even if the inheritance from the child is over the threshold
ga: Ní gá cáin ar bith a íoc sa chás seo fiú má tá an oidhreacht ón bpáiste thar an tairseach

source: Group B applies where the beneficiary is the:
ga: Bíonn Grúpa B i gceist nuair atá an tairbhí mar:

source: • Parent - see also Group A above
ga: • Thuismitheoir (féach grúpa A freisin)

source: • Grandchild or great-grandchild - see below
ga: • Duine garchlainne nó iarua - féach thíos

source: • Nephew or niece of the giver - see below
ga: • Nó mar nia nó neacht ag an té atá á thabhairt - féach thíos

source: If a grandchild is a minor (under 18 years of age) and takes a gift or inheritance from his or her grandparent Group A may apply if the grandchild's parent is deceased
ga: Má tá an duine garchlainne ina m(h)ionaoiseach (faoi 18 mbliana d'aois) agus má fhaigheann sé/sí bronntanas nó oidhreacht óna s(h)eantuismitheoir is féidir le Grúpa A a bheith i gceist má tá tuismitheoirí an duine garchlainne básaithe

source: Group A may apply to a nephew or niece if he or she has worked in the business of the person giving the benefit for the previous five years and meets the following criteria:
ga: D'fhéadfadh tairseach Ghrúpa A a bheith i gceist más rud é go raibh nia nó neacht ag obair sa ghnó atá ag an té a thugann an sochar ar feadh na cúig bliana roimhe sin agus go gcomhlíonann sé/sí na critéir seo a leanas:

source: • The nephew or niece must be a blood relation rather than a nephew or niece-in-law
ga: • Ní mór gur gaol fola atá sa nia nó neacht seachas nia nó neacht trí phósadh

source: • The gift or inheritance consists of property used in connection with the business, including farming, or of shares in the company
ga: • Is maoin a úsáideadh don ghnó, lena n-áirítear feirmeoireacht, nó scaireanna sa chuideachta, atá sa tabhartas nó san oidhreacht

source: • If the gift or inheritance consists of property then the nephew or niece must work more than 24 hours a week for the disponer at a place where the business is carried on, or for the company if the gift or inheritance is shares
ga: • Más maoin atá sa tabhartas nó san oidhreacht, ní mór don nia nó neacht oibriú ar feadh níos mó ná 24 uair an chloig in aghaidh na seachtaine don diúscróir san áit a bhfuil an gnó ar siúl, nó don chuideachta más scaireanna atá sa tabhartas nó san oidhreacht

source: But if the business is carried on exclusively by the disponer, their spouse and the nephew or niece then the requirement is that the nephew or niece work more than 15 hours a week
ga: Má tá an gnó ar bun ag an diúscróir, a gcéile agus an nia nó neacht agus acu sin amháin, ní mór don nia nó neacht oibriú ar feadh níos mó ná 15 uair an chloig in aghaidh na seachtaine

source: • The relief does not apply if the benefit is taken under a discretionary trust
ga: • Níl feidhm leis an faoiseamh seo má thógtar an sochar faoi iontaobhas lánroghnach

source: Group C applies to any relationship not included in Group A or Group B
ga: Bíonn Grúpa C i gceist do chaidreamh ar bith nach bhfuil san áireamh i nGrúpa A nó i nGrúpa B

source: If you receive a benefit from a relation of your deceased spouse or civil partner, you can be assessed with the same group as your spouse or civil partner would be if they were receiving the benefit from their relation
ga: Má fhaigheann tú sochar ó ghaol le do chéile básaithe nó ó ghaol le do pháirtnéir sibhialta básaithe, is féidir measúnú a dhéanamh ort faoin ngrúpa céanna a mbeadh ag do chéile/páirtnéir sibhialta dá mbeadh siadsan ag fáil an tsochair óna ngaol

source: For example, if you receive a benefit from the father of your spouse or civil partner, the group threshold would be Group C
ga: Mar shampla, má fhaigheann tú sochar ó athair do chéile/páirtnéir sibhialta, is é an Grúpa C an ghrúpthairseach a bheadh i gceist

source: But if you receive a benefit from the father of your spouse or civil partner and your spouse or civil partner is deceased, then the group threshold that applies to you would be the same as for a child receiving a benefit from a parent, Group A
ga: Ach má fhaigheann tú sochar ó athair do chéile/páirtnéir sibhialta agus do chéile/páirtnéir sibhialta básaithe, ansin bheadh an ghrúpthairseach a bhaineann leat mar an gcéanna leis an tairseach do pháiste atá ag fáil sochar óna t(h)uismitheoir, sé sin Grúpa A

source: Current CAT thresholds (from 12 October 2016)
ga: Tairseacha CFC ó 12 Deireadh Fómhair 2016

source: │Group A: €310,000│Applies where the beneficiary is a child (including adopted child, step-child and certain foster children) or minor child of a deceased child of the disponer
ga: │Grúpa A: €310,000│Ta Grúpa A i gceist más páiste leis an teisteoir an tairbhí (cuirtear leasleanbh nó páiste uchtaithe san áireamh anseo freisin, agus páiste altrama i gcúinsí áirithe), nó duine garchlainne mionaoiseach a bhfuil a thuismitheoir marbh

source: Parents also fall within this threshold where they take an inheritance of an absolute interest from a child
ga: Tig le tuismitheoir atá ag fáil oidhreachta (le leas iomlán) ó pháiste cáiliú do thairseach Grúpa A

source: │Group B: €32,500 │Applies where the beneficiary is a brother, sister, niece, nephew or lineal ancestor or lineal descendant of the disponer
ga: │Grúpa B: €32,500 │Tuismitheoir/ Deartháir/ Deirfiúr/ Neacht/ Nia/ Ua nó Banua/Dírshinsear leis an teisteoir │

source: │Group C: €16,250 │Applies in all other cases
ga: │Grúpa C: €16,250 │Gach cás eile │

source: │ │ │8 April │1 │8 │7 │6 │14 │
ga: │ │ │8 │1 Eanáir│8 │7 │Nollaig │Deireadh│

source: │ │2009 (up│2009 to │January │December│December│December│October │
ga: │ │2009 │Aibreán │2010 go │Nollaig │Nollaig │2012 go │Fómhair │

source: │ │to 7 │31 │2010 to │2010 to │2011 to │2012 to │2015 to │
ga: │ │(roimh 8│2009 go │7 │2010 go │2011 go │13 │2015 go │

source: │ │April │December│7 │6 │5 │13 │11 │
ga: │ │Aibreán │31 │Nollaig │6 │5 │Deireadh│11 │

source: │Group│€54,254 │€43,400 │€41,481 │€33,208 │€33,500 │€30,150 │€30,150 │
ga: │Grúpa│€54,254 │€43,400 │€41,481 │€33,208 │€33,500 │€30,150 │€30,150 │

source: │Group│€27,127 │€21,700 │€20,740 │€16,604 │€16,750 │€15,075 │€15,075 │
ga: │Grúpa│€27,127 │€21,700 │€20,740 │€16,604 │€16,750 │€15,075 │€15,075 │

source: The valuation date is the date on which the market value of the property comprising the gift/inheritance is established
ga: Is é an dáta luachála ná an dáta ar a mbunaítear luach margaidh na maoine atá i gceist sa tabhartas/oidhreacht

source: In the case of a gift, the valuation date is normally the date of the gift
ga: I gcás tabhartais, is hiondúil gur é dáta na luachála dáta an tabhartais

source: In the case of an inheritance, the valuation date is normally the earliest of the following dates:
ga: I gcás oidhreachta, is iondúil gur é an dáta luachála an chéad cheann de na dátaí seo a leanas:

source: • The date the inheritance can be set aside for or given to the beneficiary
ga: • An dáta is féidir an oidhreacht a chur ar leataobh nó a thabhairt don tairbhí

source: • The date it is actually retained for the benefit of the beneficiary
ga: • An dáta a gcoinnítear é chun sochair an tairbhí

source: • The date it is transferred or paid over to the beneficiary
ga: • An dáta a n-aistrítear chuig an tairbhí é nó a n-íoctar leis é

source: The valuation date will normally be the date of death in the following circumstances:
ga: Is hiondúil gurb é an dáta báis an dáta luachála sna himthosca seo a leanas:

source: • Gift made in contemplation of death (Donatio Mortis Causa)
ga: • Tabhartas a dhéantar nuair a bhíonn duine ag smaoineamh ar an mbás (Donatio Mortis Causa)

source: • Where a power of revocation has not been exercised
ga: • Sa chás nár úsáideadh cumhacht cúlghairme

source: This could arise where a person makes a gift of property but reserves the power to revoke, or take back, the gift
ga: D’fhéadfadh sé seo tarlú nuair a dhéanann duine tabhartas maoine ach go gcoinníonn sé/sí an chumhacht an tabhartas a chúlghairm, nó a thógáil ar ais

source: If he or she dies and this power ceases, the recipient then becomes taxable as inheriting the benefit
ga: Má chailltear é nó í agus go dtagann deireadh leis an gcumhacht seo, bíonn an faighteoir inchánaithe mar dhuine a fuair an sochar mar oidhreacht

source: If the beneficiary had free use of the benefit before this, he or she will be taxed as receiving a gift of the value of the use of the property
ga: Má bhí úsáid in aisce ag an tairbhí as an sochar roimhe seo, gearrfar cáin air/uirthi mar dhuine a fuair tabhartas de luach úsáide na maoine

source: The gift or inheritance is valued as the market value at the time you become entitled to the use or benefit of it
ga: Is é an luach atá ar bhronntanas nó ar oidhreacht ná an luach ar an margadh ag an am go mbeidh tú i dteideal úsáid nó leas a bhaint as

source: The value that is taxable is the market value minus the following deductions
ga: Is é an luach atá inchánach ná an luach ar an margadh lúide na asbhaintí seo a leanas

source: You can deduct 'any liabilities, costs and expenses that are properly payable
ga: Is féidir 'dliteanais, costais nó speansais ar bith atá iníoctha de réir ceart' a bhaint as

source: This would include debts that must, by law, be paid and that are payable out of the benefit or because of it
ga: Bheadh fiacha a gcaithfear íoc de réir dlí agus atá le n-íoc ón sochar nó dá bharr i gceist anseo

source: With an inheritance, these may be funeral expenses, the costs of administering the estate, or debts owed by the deceased
ga: Le hoidhreacht, bheadh costais shochraide, costais riaracháin an eastáit, nó fiacha atá dlite ag an duine mhairbh san áireamh anseo

source: For a gift, they could include legal costs or stamp duty
ga: Do bhronntanas, d'fhéadfadh costais dlí nó dleacht stampála a bheith san áireamh

source: If you make a payment for the benefit or some other contribution in return for it, this may also be deducted
ga: Má dhéanann tú íocaíocht as an sochar nó má thugann tú cúnamh nó cabhair eile mar chúiteamh air, is féidir é seo a bhaint as freisin

source: This is known as a 'consideration' and could be, for example, a part payment, an amount paid annually to the donor or other person, or a payment of debts of the donor
ga: Tugtar 'comaoin' air seo, agus mar shampla d'fhéadfadh páirtíocaíocht, suim a íoctar leis an ndeontóir nó le duine eile go bliantúil, nó íocaíocht as fiacha an deontóra a bheith i gceist

source: If you do not receive full ownership but instead receive a benefit for a limited period, then a number of factors are taken into account to calculate the value
ga: Má fhaigheann tú sochar ar feadh tréimhse theoranta seachas úinéireacht iomlán a fháil air, tá roinnt fachtóirí a thógtar san áireamh chun an luach a mheas

source: The calculation of the value of a limited interest is explained in Revenue Guide IT 39 (pdf) (Appendix 7)
ga: Mínítear an chaoi chun luach leasa teoranta a ríomh i dTreoir IT 39 de chuid na Coimisinéirí Ioncaim (pdf) (féach Aguisín 7)

source: Capital Acquisitions Tax is charged at 33% on gifts or inheritances made on or after 5 December 2012 (the rate was formerly 30%)
ga: Sé an ráta caighdeánach ar Cháin Fháltais Caipitiúil ná 33% ar bhronntanais nó oidhreachtaí déanta ó mheán oíche an 5ú Nollaig 2012. B’é an ráta ná 30% roimhe sin

source: This only applies to amounts over the group threshold
ga: Ní bhaineann sé seo ach le suimeanna os cionn na grúpthairsí

source: For example, if you have received gifts from your parents with a taxable value of €550,000, you only pay tax on the amount over the appropriate group threshold (Group A threshold from 12 October 2016: €310,000)
ga: Mar shampla, más rud é go bhfuair tú bronntanais de €550,000 luach inchánaithe ó do thuismitheoirí, ní íocfá cáin ach amháin ar an méid os cionn na grúpthairsí cuí. (12 Deireadh Fómhair 2016: Grúpa A: €310,000)

source: So €240,000 is taxed at 33%
ga: Mar sin, gearrfar cáin ag ráta 33% ar €240,000

source: The following are exempt from Capital Acquisitions Tax:
ga: Tá na nithe seo a leanas díolmhaithe ó Cháin Fháltais Caipitiúil:

source: • Gifts or inheritances from a spouse or civil partner
ga: • Bronntanais nó oidhreachtaí ó chéile/páirtnéir sibhialta leat

source: • Payments for damages or compensation
ga: • Íocaíochtaí cúitimh nó íocaíochtaí ar dhamáistí

source: • Benefits used only for the medical expenses of a person who is permanently incapacitated due to physical or mental illness
ga: • Sochair a úsáidtear i gcomhair costais leighis amháin do dhuine atá faoi éagumas buan de bharr galar fisiciúil nó meabhrach

source: • Benefits taken for charitable purposes or received from a charity
ga: • Sochair a thógtar ar mhaithe le carthanacht nó a fhaightear ó charthanas

source: • Winnings from a lottery, sweepstake, game, or betting
ga: • Airgead buaite i gcrannchur, scuabgheall, cluiche nó gealltóireacht

source: • Retirement benefits and pension and redundancy payments are not usually liable to Gift Tax
ga: • Go hiondúil ní bhíonn Cáin Bhronntanais le gearradh ar shochair scoir ná ar íocaíochtaí iomarcaíochta nó pinsin

source: The first €3,000 of the total value of all gifts received from one person in any calendar year is exempt
ga: Tá an chéad €3,000 den luach iomlán ar na bronntanais ar fad a fhaightear ó duine amháin i mbliain na féilire ar bith díolmhaithe

source: This does not apply to inheritances
ga: Ní bhaineann sé seo le hoidhreachtaí

source: If you receive a gift or inheritance of a house that has been your main residence, it may be exempt from tax if you do not own or have an interest in any other house
ga: Má fhaigheann tú bronntanas nó oidhreacht a bhí mar phríomháit cónaithe agat, b'fhéidir go mbeadh sé díolmhaithe ó cháin Mura bhfuil aon teach eile nó leas i dteach eile agat

source: There are conditions on how long you must be resident in the house before and after receiving the benefit
ga: Tá coinníollacha ann maidir leis an dtréimhse ama go gcaithfidh tú a bheith i do chónaí sa teach roimh agus tar éis duit an sochar a fháil

source: More information is available on this website - see 'Dwelling-house exemption' below - or Revenue's leaflet CAT 10
ga: Chun tuilleadh eolais a fháil, féach 'Díolúine do theach cónaithe' thíos nó bileog na gCoimisinéirí Ioncaim CAT 10)

source: If a parent receives an inheritance from his/her child, and takes full and complete ownership of the inheritance, it usually taxable under Group A
ga: Má fhaigheann tuismitheoir oidhreacht óna bpáiste agus má ghlacann sé/sí úinéireacht iomlán na hoidhreachta, bíonn sé inchánachfaoi Ghrúpa A go hiondúil

source: But it is exempt if, in the previous 5 years, the child took an inheritance or gift from either parent and it was not exempt from Capital Acquisitions Tax
ga: Ach bíonn sé díolmhaithe más rud é gur thóg an páiste bronntanas nó oidhreacht ó cheachtar den dá thuismitheoir nach raibh díolmhaithe ó Cháin Fháltais Chaipitiúil sna cúig bliana roimhe sin

source: Other exemptions relate to certain Irish Government securities, bankruptcy, heritage property, and support of a child or spouse
ga: Baineann díolúintí eile le hurrúis áirithe de chuid Rialtas na hÉireann, féimheacht, maoin oidhreachta, agus tacaíocht do pháiste nó do chéile

source: You can get further information on reliefs and exemptions from Revenue
ga: Féach Aguisín 6 de Threoir IT39 na gCoimisinéirí Ioncaim i gcomhair tuilleadh eolais maidir leis na heisceachtaí agus na faoisimh thuas

source: Tax relief applies to gifts and inheritances of business property and reduces the taxable value of the property by 90%
ga: Baineann faoiseamh cánach le bronntanais agus oidhreachtaí ar mhaoin gnó iad agus tugtar laghdú 90% do luach inchánachna maoine

source: More information on business relief can be found in Revenue leaflet CAT 4
ga: Tá tuilleadh eolais faoi faoiseamh gnó sa bhileog na gCoimisinéirí Ioncaim CAT 4

source: Tax relief applies to gifts and inheritances of agricultural property and reduces the market value of the property by 90% for the purposes of Capital Acquisitions Tax
ga: Baineann faoiseamh cánach le bronntanais agus oidhreachtaí ar mhaoin thalmhaíochta iad agus tugtar laghdú 90% do luach inchánachna maoine ar mhaithe le Cáin Fháltais Caipitiúil

source: More information on agricultural relief can be found in Revenue leaflet CAT 5
ga: Tá tuilleadh eolais faoi faoiseamh talmhaíochta sa bhileog na gCoimisinéirí Ioncaim CAT 5

source: Making a return and paying Capital Acquisitions Tax
ga: Ag tabhairt faisnéis cánach agus ag íoc Cáin Fháltais Caipitiúil

source: If you have received a gift or inheritance then you are responsible for paying any Capital Acquisitions Tax that is due
ga: Más rud é go bhfuil bronntanas nó oidhreacht faighte agat tá tusa freagrach as aon Cháin Fháltais Caipitiúil atá dlite a íoc

source: If you are not resident in Ireland, you must get an agent who is resident in Ireland, such as a solicitor, to take responsibility for the payment of CAT
ga: Mura bhfuil cónaí ort in Éirinn, ní mór duit gníomhaire a fháil a chónaíonn in Éirinn chun freagracht a ghlacadh as CAT a íoc, mar shampla, aturnae a chónaíonn in Éirinn

source: You must make a tax return if the total value of gifts and inheritances you have received in one of the groups, A, B or C, since 5 December 1991 is more than 80% of the tax-free threshold for that group
ga: Chaithfidh tú tuairisceán cánach a dhéanamh má tá a luach iomlán na bronntanais agus na n-oidhreachtaí atá faighte agat i ngrúpa ar bith, A, B nó C, ón 5 Nollaig 1991 i leith níos mó ná 80% den thairseach saor ó cháin don ghrúpa sin

source: For example, if you received a gift of €20,000 from a brother and then an inheritance of €10,000 from a grandparent, both of these benefits would come under Group B and amount to a total of €30,000
ga: Mar shampla, más rud é go bhfuair tú bronntanas de €20,000 ó dheartháir leat agus ansin oidhreacht de €10,000 ó sheantuismitheoir, tagann an dá sochar seo faoi Grúpa B agus luach iomlán €30,000 acu

source: The threshold for Group B is currently €32,500 and 80% of this is €26,000
ga: Is í €32,500 an tairseach do Ghrúpa B agus is é €26,000 80% di seo
